Revit 2026 API

# RebarBendDataHookBendRadius Property

---

The radius of the hook fillets in the Rebar shape. The default value is 0.0.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double HookBendRadius { get; set; }
```
```vb
Public Property HookBendRadius As Double
	Get
	Set
```
```cpp
public:
property double HookBendRadius {
	double get ();
	void set (double value);
}
```
```fsharp
member HookBendRadius : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for hookBendRadius is not finite |

Inner radius, not centerline

#### Reference

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace